Documents/ГрафикРаботыЗамерщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ГрафикРаботыЗамерщиков</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Невыходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Невыходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Невыходы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бригада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Бригады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиПродаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ГрафикРаботыЗамерщиков/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	ПериодРегистрации = НачалоМесяца(ТекущаяДатаСеанса());
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(ПериодРегистрации) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
         	НСтр("ru = 'Не указан Период регистрации!'"), ,
        	"ОтображениеПериодаРегистрации",,Отказ);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ГрафикРаботыЗамерщиков.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ГрафикРаботыЗамерщиков КАК ГрафикРаботыЗамерщиков
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ГрафикРаботыЗамерщиков.ПериодРегистрации, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
		|	И ГрафикРаботыЗамерщиков.Проведен
		|	И ГрафикРаботыЗамерщиков.Ссылка <> &Ссылка";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Существует документ за данный период: " + Строка(Выборка.Ссылка) + "! Проведение невозможно!", , ,, Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр Невыходы
	ТаблицаДвижений = Новый ТаблицаЗначений;
	ТаблицаДвижений.Колонки.Добавить("Сотрудник");
	//ТаблицаДвижений.Колонки.Добавить("ТочкаПродаж");
	ТаблицаДвижений.Колонки.Добавить("Дата", новый ОписаниеТипов("Дата"));
	ТаблицаДвижений.Колонки.Добавить("ВремяНачала", новый ОписаниеТипов("Дата"));
	ТаблицаДвижений.Колонки.Добавить("ВремяОкончания", новый ОписаниеТипов("Дата"));
	ТаблицаДвижений.Колонки.Добавить("Комментарий", новый ОписаниеТипов("Строка"));
	ТаблицаДвижений.Колонки.Добавить("КодСтроки", новый ОписаниеТипов("Число"));

	ВремяНачалаГрафика    = Константы.НачалоРабочегоВремениЗамеров.Получить();
	ВремяОкончанияГрафика = Константы.КонецРабочегоВремениЗамеров.Получить();
	
	//нужно невыход разбить на дневные интервалы, т.к. в регистре запись хранится в разрезе дней
	Для Каждого ТекущаяСтрока Из Сотрудники Цикл
		ВремДатаНачала = ТекущаяСтрока.ДатаНачала;
		Пока ВремДатаНачала <= ТекущаяСтрока.ДатаОкончания Цикл
			НоваяСтрока = ТаблицаДвижений.Добавить();
			НоваяСтрока.Сотрудник = ТекущаяСтрока.Сотрудник;
			//НоваяСтрока.ТочкаПродаж = ТочкаПродаж;
			НоваяСтрока.Комментарий = ТекущаяСтрока.Комментарий;
			НоваяСтрока.Дата = ВремДатаНачала;
			НоваяСтрока.ВремяНачала = Макс(?(ВремДатаНачала = ТекущаяСтрока.ДатаНачала, ТекущаяСтрока.ВремяНачала, Дата(1,1,1,0,0,1)), ВремяНачалаГрафика);
			НоваяСтрока.ВремяОкончания = Мин(?(ВремДатаНачала < ТекущаяСтрока.ДатаОкончания, Дата(1,1,1,23,59,59), ТекущаяСтрока.ВремяОкончания), ВремяОкончанияГрафика);
			НоваяСтрока.КодСтроки = ТекущаяСтрока.НомерСтроки;
			ВремДатаНачала = ВремДатаНачала + 86400;
		КонецЦикла;
		
	КонецЦикла;
		
	Движения.Невыходы.Записывать = Истина;	
	Для Каждого ТекущаяСтрока Из ТаблицаДвижений Цикл
		Движение = Движения.Невыходы.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ТекущаяСтрока);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти
